Revit 2027 API
ParameterTypeId.ToposolidStructureIdParam Property
 "Structure"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ToposolidStructureIdParam { get; }
Public Shared ReadOnly Property ToposolidStructureIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ToposolidStructureIdParam {
	ForgeTypeId^ get ();
}
static member ToposolidStructureIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace